app/Models/UserModel.php

INSERT INTO `users` (`username`, `email`, `password`, `created_at`, `updated_at`) VALUES ('johndoe', 'johndoe@example.com', '$2y$10$1L45EniXMnT2rQbr.PD2D.P87Nj9UjlLH39/h4377ctrCe1xYlIRW', '2025-10-31 20:00:27', '2025-10-31 20:00:27')
---
    public function registerUser($data)
    {
        return $this->insert($data);

SELECT *
FROM `users`
WHERE `username` = 'fahmi'
OR `email` = 'fahmi'
 LIMIT 1
---
    public function loginUser($username, $password)
    {
        $user = $this->where('username', $username)
                     ->orWhere('email', $username)
                     ->first();